16.2.0 after state change: 
terraform0-14-11 state mv "module.eks.aws_security_group_rule.cluster_private_access[0]" "module.eks.aws_security_group_rule.cluster_private_access_cidrs_source[0]"

```
❯ terraform0-14-11 plan | grep module.eks
...<same output>
  # module.eks.aws_security_group_rule.cluster_private_access[0] will be created
  + resource "aws_security_group_rule" "cluster_private_access" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
          + "172.16.0.0/12",
          + "192.168.0.0/16",
        ]
      + description              = "Allow private K8S API ingress from custom source."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e2419108f9d9ac74"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source[0] will be destroyed
  - resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      - cidr_blocks       = [
          - "10.0.0.0/8",
          - "172.16.0.0/12",
          - "192.168.0.0/16",
        ] -> null
      - description       = "Allow private K8S API ingress from custom source." -> null
      - from_port         = 443 -> null
      - id                = "sgrule-2706511318" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0e2419108f9d9ac74" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

(I did not run apply here)

Output after updating module to 17.0.2 and doing terraform init

```
  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ id               = "https://07E8541E05A10FA312D02FD8216A4A64.gr7.us-east-1.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"          = "no-cache, private"
          - "Content-Length"         = "2"
          - "Content-Type"           = "text/plain; charset=utf-8"
          - "Date"                   = "Fri, 28 May 2021 15:54:41 GMT"
          - "X-Content-Type-Options" = "nosniff"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[3] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers_launch_template" {
        id                        = "ms-test-apps-windows20210520153227313800000015"
        name                      = "ms-test-apps-windows20210520153227313800000015"
        # (23 unchanged attributes hidden)


      ~ launch_template {
            id      = "lt-0d32de96ed566ad56"
            name    = "ms-test-apps-windows20210520153226695500000009"
          ~ version = "6" -> (known after apply)
        }

        # (17 unchanged blocks hidden)
    }

  # module.eks.aws_launch_template.workers_launch_template[3] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        id                      = "lt-0d32de96ed566ad56"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "ms-test-apps-windows20210520153226695500000009"
        tags                    = {
            "Application"        = "Insurance APD Shared"
            "Assigned VP"        = "IT"
            "CCC Product Family" = "Enterprise"
            "Horizontal"         = "APD"
            "ImportantNote"      = "This resource is managed through automation - do not modify through AWS console - ask owner for assistance - thanks"
            "Owner"              = "DevOps"
            "Product/Service"    = "Microservices"
            "Usage"              = "Always"
            "Vertical"           = "Insurance"
        }
        # (13 unchanged attributes hidden)

      ~ block_device_mappings {
          ~ device_name = "/dev/xvda" -> "/dev/sda1"

            # (1 unchanged block hidden)
        }







        # (8 unchanged blocks hidden)
    }

  # module.eks.aws_security_group_rule.cluster_private_access[0] will be created
  + resource "aws_security_group_rule" "cluster_private_access" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
          + "172.16.0.0/12",
          + "192.168.0.0/16",
        ]
      + description              = "Allow private K8S API ingress from custom source."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e2419108f9d9ac74"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source[0] will be updated in-place
  ~ resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      - description       = "Allow private K8S API ingress from custom source." -> null
        id                = "sgrule-2706511318"
        # (9 unchanged attributes hidden)
    }

  # module.eks.local_file.kubeconfig[0] must be replaced
-/+ resource "local_file" "kubeconfig" {
      ~ file_permission      = "0644" -> "0600" # forces replacement
      ~ id                   = "318828bf5966530ea5b846ccc4378b79c896ec17" -> (known after apply)
        # (3 unchanged attributes hidden)
    }
```

Here is where it fails if I apply